snlkuharlocal/src/Catalogs/РаспределениеСотрудниковПоНаправлениямПродаж/РаспределениеСотрудниковПоНаправлениямПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РаспределениеСотрудниковПоНаправлениямПродаж</name>
  <attributes>
    <name>НаправлениеПродаж</name>
    <type>
      <types>CatalogRef.НаправленияПродаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/РаспределениеСотрудниковПоНаправлениямПродаж/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборКонтрагентов(Команда)    
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("Владелец", ОбщегоНазначения_ПИ.ПолучитьОсновнуюИБ());

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор);      
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)      
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораСотрудника", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);

	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)     
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор);     
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДопПараметры) Экспорт       
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуТовары(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДобавитьНовуюСтрокуТовары(ВыбранноеЗначение);
	КонецЕсли;        
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуТовары(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Номенклатура", ВыбЭлемент);
	СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Товары.Добавить();
		СтрокаТовара.Номенклатура = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтрагента(ВыбранноеЗначение, ДопПараметры) Экспорт    
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуКонтрагенты(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДобавитьНовуюСтрокуКонтрагенты(ВыбранноеЗначение);
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуКонтрагенты(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Контрагент", ВыбЭлемент);
	СтрокиТоваров = Объект.Контрагенты.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Контрагенты.Добавить();
		СтрокаТовара.Контрагент = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСотрудника(ВыбранноеЗначение, ДопПараметры) Экспорт   
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуСотрудники(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ДобавитьНовуюСтрокуКонтрагенты(ВыбранноеЗначение);
	КонецЕсли;                    
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуСотрудники(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Сотрудник", ВыбЭлемент);
	СтрокиТоваров = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Сотрудники.Добавить();
		СтрокаТовара.Сотрудник = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
